// Задание 4.1. Вывод карточек товаров

// Напишите функцию parseProducts
// Аргументом функции является JSON
// Распарсите JSON, переданный как аргумент функции и запишите в постоянную data
// Верните как результат функции свойство products полученного при парсинге объекта data

// Напишите функцию renderProductsCards
// Аргументом функции является JSON
// Выполните функцию clearProducts - она уже написана в коде, просто вызовите ее, аргументы не требуются
// Выполните функцию parseProducts, передав в неё JSON - аргумент функции
// Выполните функцию addProduct с каждым элементом массива, полученного при выполнении parseProducts
